# Basic Knowledge

> If you are not familiar with basic operating system theory, the author actually recommends [starting from the open-source Linux kernel monolithic kernel](https://arttnba3.cn/2021/02/21/OS-0X00-LINUX-KERNEL-PART-I/). This article will basically not cover fundamental operating system concepts.

The Windows operating system's full name is **Windows New Technology** (abbreviated as **Windows NT**). It _once_ claimed to use a **micro kernel** architecture, meaning **most system components exist in user mode, with only essential components existing in kernel mode**. However, in reality, Windows has now placed quite a lot of things in kernel mode, so the current NT kernel is more akin to a _hybrid kernel_.

![Overview of Windows Kernel Architecture](https://s2.loli.net/2025/02/01/o9DzrNqSvLxIfdR.png)

In this article, we will mainly introduce the basic operating principles and some fundamental components of the **64-bit** Windows NT kernel, primarily using Windows 10 as an example. _Content related to 32-bit will not be covered_.

> For definitions of some Windows kernel structures, refer to [this website](https://www.vergiliusproject.com/kernels)

## I. User Mode Components

The Windows NT operating system is divided into four main parts in user mode:

- System Processes
- Services
- Applications
- Environment Subsystem


- Graphic Device Interface: Responsible for all basic drawing functions. Since NT 4.0, it has been moved into kernel mode (previously in user mode).

The Executive's code resides in `ntoskrnl.exe`, and its interfaces exported to user mode are in `ntdll.dll`.

### Middle Layer: (Micro)Kernel

The **Kernel** in the NT kernel is **only** responsible for the most basic _hardware-side duties_ such as multi-processor synchronization, direct thread scheduling, and interrupt/exception dispatching, which aligns with the fundamental philosophy of the "micro kernel" architecture.

The Kernel's code resides in `ntoskrnl.exe`.

### Middle Layer: Kernel Mode Drivers

Windows has two types of drivers: user-mode drivers and kernel-mode drivers. The latter provides corresponding interfaces to the former and passes data to lower-level drivers.

Kernel-mode drivers can be divided into three layers as shown in the figure. The closer to the bottom, the more closely tied to specific hardware structures:

![](https://s2.loli.net/2025/02/01/KeypmW8xGPViXQH.png)

Kernel-mode drivers are implemented as discrete, modular components rather than being located in a specific PE file (somewhat like LKMs?).

### Lower Layer: Hardware Abstraction Layer (HAL)

The **Hardware Abstraction Layer** (HAL) is responsible for hiding and masking the various details of different underlying hardware, thereby providing **unified abstract hardware interfaces** to the upper kernel layer, such as unified abstractions of hardware behaviors like IO interfaces and interrupt controllers.

The purpose of HAL is mainly to eliminate differences between hardware architectures, making it easier for operating system and driver developers to write code that is not strongly tied to specific hardware architectures for cross-platform execution, thus avoiding the need to write dedicated code for each hardware platform.

It should be noted that HAL is mainly responsible for abstracting general resources like IO. Some operations of certain drivers still bypass HAL and communicate directly with the hardware.

HAL-related code resides in `hal.dll`.

## "Everything Is an Object"

Similar to the "everything is a file" philosophy in *NIX systems, in the Windows NT kernel there is also the concept that **everything is an object**. Files, devices, synchronization mechanisms, registry keys, etc. are **all represented as objects in the kernel**. Each object has a `header` that stores basic object information (such as name, type, location), and a `body` that stores data.

Objects in the NT kernel can be divided into two categories:

- Executive Objects: Resource objects exposed externally by the Executive (such as processes, threads, files, etc.), visible to user mode.
- Kernel Objects: The most basic resource objects (such as physical devices, etc.), not visible to user mode.

### I. \_OBJECT\_HEADER: Object Basic Information

In the NT kernel, the `_OBJECT_HEADER` structure is used to store basic object information, defined as follows:
```powershell
kd> dt nt!_OBJECT_HEADER
   +0x000 PointerCount     : Int8B
   +0x008 HandleCount      : Int8B
   +0x008 NextToFree       : Ptr64 Void
   +0x010 Lock             : _EX_PUSH_LOCK
   +0x018 TypeIndex        : UChar
   +0x019 TraceFlags       : UChar
   +0x019 DbgRefTrace      : Pos 0, 1 Bit
   +0x019 DbgTracePermanent : Pos 1, 1 Bit
   +0x01a InfoMask         : UChar
   +0x01b Flags            : UChar
   +0x01b NewObject        : Pos 0, 1 Bit
   +0x01b KernelObject     : Pos 1, 1 Bit
   +0x01b KernelOnlyAccess : Pos 2, 1 Bit
   +0x01b ExclusiveObject  : Pos 3, 1 Bit
   +0x01b PermanentObject  : Pos 4, 1 Bit
   +0x01b DefaultSecurityQuota : Pos 5, 1 Bit
   +0x01b SingleHandleEntry : Pos 6, 1 Bit
   +0x01b DeletedInline    : Pos 7, 1 Bit
   +0x01c Reserved         : Uint4B
   +0x020 ObjectCreateInfo : Ptr64 _OBJECT_CREATE_INFORMATION
   +0x020 QuotaBlockCharged : Ptr64 Void
   +0x028 SecurityDescriptor : Ptr64 Void
   +0x030 Body             : _QUAD
```

In addition to the fixed `_OBJECT_HEADER`, an object can also **have additional optional headers to store extra information**. Whether the corresponding optional header exists is determined by the `_OBJECT_HEADER->InfoMask` bitmask:

![](https://s2.loli.net/2025/02/01/S8hIzlRWCFGjTed.png)

When a corresponding bit exists in the `_OBJECT_HEADER->InfoMask` bitmask, it indicates that _the corresponding optional header exists_. Since the storage order of optional headers is fixed, the NT kernel can easily calculate the offsets for different headers. The correspondence between bitmask and header type & size is as follows:

| Bit  |              Type              | Size (on X86) |
| :--: | :----------------------------: | :-----------: |
| 0x01 | nt!_OBJECT_HEADER_CREATOR_INFO |     0x10      |
| 0x02 |  nt!_OBJECT_HEADER_NAME_INFO   |     0x10      |
| 0x04 | nt!_OBJECT_HEADER_HANDLE_INFO  |     0x08      |
| 0x08 |  nt!_OBJECT_HEADER_QUOTA_INFO  |     0x10      |
| 0x10 | nt!_OBJECT_HEADER_PROCESS_INFO |     0x08      |

**Before NT kernel version 19H1**, the Windows kernel **only** used the `Pool Allocator`. At that time, each allocated kernel pool object had a `_POOL_HEADER` structure that stored relevant information:

```powershell
kd> dt nt!_POOL_HEADER
   +0x000 PreviousSize     : Pos 0, 8 Bits
   +0x000 PoolIndex        : Pos 8, 8 Bits
   +0x002 BlockSize        : Pos 0, 8 Bits
   +0x002 PoolType         : Pos 8, 8 Bits
   +0x000 Ulong1           : Uint4B
   +0x004 PoolTag          : Uint4B
   +0x008 ProcessBilled    : Ptr64 _EPROCESS
   +0x008 AllocatorBackTraceIndex : Uint2B
   +0x00a PoolTagHash      : Uint2B
```

From this, we can derive the basic structure of a kernel object as shown in the figure below:

![](https://s2.loli.net/2025/02/01/rzoqgZXxNSmsa52.png)

### II. Object Manager and Namespaces

All objects in the NT kernel are managed through the **Object Manager**. User-mode access to any object must go through the Object Manager subsystem. The Object Manager is primarily responsible for the following tasks:

- Managing the creation and destruction of objects
- Maintaining the object namespace database
- Tracking resources allocated to processes
- Tracking access permissions for specific objects
- Managing object lifetimes

